; domain
(define (domain lunar)
    (:requirements :strips :typing)

    ; -------------------------------
    ; Types
    ; -------------------------------
    (:types
        vehicle - object
        lander rover - vehicle

        location - object

        data - object
        image scan - data

        sample - object
    )

    ; -------------------------------
    ; Predicates
    ; -------------------------------
    (:predicates
        (flying ?l - lander); lander in flight
        (landed ?l - lander); lander stationary
        
        (carrying ?l - lander ?r - rover); lander is carrying certain rover
        (commands ?l - lander ?r - rover);lander commands a rover (they are connected)

        (undeployed ?r - rover); rover not ready
        (deployed ?r - rover); rover ready

        (path ?l1 - location ?l2 - location); path exists between 1 & 2
        (located ?x - object ?l - location) ; object is in this location
        
        (heldSample ?v - vehicle ?s - sample); sample held in vehicle storage
        (storeEmpty ?v - vehicle)
        ; (storeFull ?v - vehicle); vehicle holding physical sample

        (memEmpty ?r - rover)
        ;(memFull ?r - rover); is rover holding data in memory
        (heldData ?v - vehicle ?d - data); data stored in vehicle memory

        (transmitted ?d - data); img/scan has be transmitted to a lander
        (sampleDeposited ?s - sample); sample has been deposited in a lander
    )

    ; -------------------------------
    ; Actions
    ; -------------------------------
    (:action land_lander; land lander at any location
        :parameters (?l - lander ?lo - location)
        :precondition (and
            (flying ?l)
        )
        :effect (and
            (landed ?l)
            (not (flying ?l))
            (located ?l ?lo)
        )
    )
    
    (:action deploy_rover; deploy rover from lander that was carrying it
        :parameters (?l - lander ?r - rover ?lo - location)
        :precondition (and
            (landed ?l)
            (carrying ?l ?r)
            (commands ?l ?r)
            (undeployed ?r)
            (located ?l ?lo)
        )
        :effect (and
            (not (undeployed ?r))
            (deployed ?r)
            (not (carrying ?l ?r))
            (located ?r ?lo)
        )
    )

    (:action move_rover; move rover from one location to another
        :parameters (?r - rover ?l1 - location ?l2 - location)
        :precondition (and
            (deployed ?r)
            (located ?r ?l1)
            (path ?l1 ?l2)
        )
        :effect (and
            (not (located ?r ?l1))
            (located ?r ?l2)
        )
    )

    (:action capture_image; rover takes image at location & stores data in memory
        :parameters (?r - rover ?l - location ?i - image)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?i ?l)
            (memEmpty ?r)
        )
        :effect (and
            (heldData ?r ?i)
            ;(memFull ?r)
            (not (memEmpty ?r))
            (not (located ?i ?l)); assumed data can only be collected once
        )
    )
    
    (:action scan_radar; rover takes scan at location & stores data in memory
        :parameters (?r - rover ?l - location ?s - scan)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?s ?l)
            (memEmpty ?r)
        )
        :effect (and
            (heldData ?r ?s)
            (not (memEmpty ?r))
            ;(memFull ?r)
            (not (located ?s ?l)); assumed data can only be collected once
        )
    )

    (:action transmit_data; rover transmits held data to a lander
        :parameters (?r - rover ?l - lander ?d - data)
        :precondition (and
            (deployed ?r)
            ;(memFull ?r)
            (commands ?l ?r)
            (heldData ?r ?d)
        )
        :effect (and
            (not (heldData ?r ?d))
            (memEmpty ?r)
            ;(not (memFull ?r))
            (heldData ?l ?d)
            
            (transmitted ?d)
        )
    )
    
    (:action collect_sample; rover collects sample from location
        :parameters (?r - rover ?l - location ?sa - sample)
        :precondition (and
            (deployed ?r)
            (located ?r ?l)
            (located ?sa ?l)
            (storeEmpty ?r)
        )
        :effect (and
            (heldSample ?r ?sa)
            ; (storeFull ?r)
            (not (storeEmpty ?r))
            (not (located ?sa ?l)); assumed sample can only be collected once
        )
    )
    

    (:action deposit_sample; put sample from rover into lander
        :parameters (?r - rover ?l - lander ?lo - location ?sa - sample)
        :precondition (and
            (deployed ?r)
            (landed ?l)
            (located ?r ?lo)
            (located ?l ?lo)
            (commands ?l ?r)
            ; (storeFull ?r)
            (heldSample ?r ?sa)
            (storeEmpty ?l)
        )
        :effect (and
            (not (heldSample ?r ?sa))
            (storeEmpty ?r)
            ; (not (storeFull ?r))

            (heldSample ?l ?sa)
            ; (storeFull ?l)
            (not (storeEmpty ?l))
            
            (sampleDeposited ?sa)
        )
    )
)

; problem
(define (problem lunar-mission-2)
    (:domain lunar)

    (:objects
        wp1 wp2 wp3 wp4 wp5 wp6 - location

        l1 l2 - lander
        r1 r2 - rover

        img1 img2 - image
        scan1 scan2 - scan

        smpl1 smpl2 - sample
    )

    (:init
        ;map
        (path wp1 wp2)
        (path wp2 wp1)
        (path wp2 wp3)
        (path wp2 wp4)
        (path wp3 wp5)
        (path wp4 wp2)
        (path wp5 wp3)
        (path wp5 wp6)
        (path wp6 wp4)

        ;landers
        (landed l1)
        (commands l1 r1)
        (storeEmpty l1)
        (located l1 wp2)

        (flying l2)
        (carrying l2 r2)
        (commands l2 r2)
        (storeEmpty l2)

        ;rovers
        (deployed r1)
        (storeEmpty r1)
        (memEmpty r1)
        (located r1 wp2)

        (undeployed r2)
        (storeEmpty r2)
        (memEmpty r2)

        ;points of interest
        (located img1 wp3)
        (located scan1 wp4)
        (located img2 wp2)
        (located scan2 wp6)
        (located smpl1 wp5)
        (located smpl2 wp1)
    )

    (:goal
        (and
            ;all data transmitted to landers
            (transmitted img1)
            (transmitted img2)
            (transmitted scan1)
            (transmitted scan2)
            ;all samples collected
            (sampleDeposited smpl1)
            (sampleDeposited smpl2)
        )
    )
)

; plan
1. (land_lander l2 wp5)
   deleted: (flying l2)
   added: (landed l2) (located l2 wp5)
   goals met: 0 of 6
2. (deploy_rover l2 r2 wp5)
   deleted: (undeployed r2) (carrying l2 r2)
   added: (deployed r2) (located r2 wp5)
   goals met: 0 of 6
3. (move_rover r1 wp2 wp1)
   deleted: (located r1 wp2)
   added: (located r1 wp1)
   goals met: 0 of 6
4. (collect_sample r2 wp5 smpl1)
   deleted: (storeempty r2) (located smpl1 wp5)
   added: (heldsample r2 smpl1)
   goals met: 0 of 6
5. (collect_sample r1 wp1 smpl2)
   deleted: (storeempty r1) (located smpl2 wp1)
   added: (heldsample r1 smpl2)
   goals met: 0 of 6
6. (move_rover r1 wp1 wp2)
   deleted: (located r1 wp1)
   added: (located r1 wp2)
   goals met: 0 of 6
7. (capture_image r1 wp2 img2)
   deleted: (memempty r1) (located img2 wp2)
   added: (helddata r1 img2)
   goals met: 0 of 6
8. (transmit_data r1 l1 img2)
   deleted: (helddata r1 img2)
   added: (memempty r1) (helddata l1 img2) (transmitted img2)
   goals met: 1 of 6
9. (deposit_sample r2 l2 wp5 smpl1)
   deleted: (heldsample r2 smpl1) (storeempty l2)
   added: (storeempty r2) (heldsample l2 smpl1) (sampledeposited smpl1)
   goals met: 2 of 6
10. (move_rover r2 wp5 wp6)
   deleted: (located r2 wp5)
   added: (located r2 wp6)
   goals met: 2 of 6
11. (scan_radar r2 wp6 scan2)
   deleted: (memempty r2) (located scan2 wp6)
   added: (helddata r2 scan2)
   goals met: 2 of 6
12. (move_rover r2 wp6 wp4)
   deleted: (located r2 wp6)
   added: (located r2 wp4)
   goals met: 2 of 6
13. (transmit_data r2 l2 scan2)
   deleted: (helddata r2 scan2)
   added: (memempty r2) (helddata l2 scan2) (transmitted scan2)
   goals met: 3 of 6
14. (scan_radar r2 wp4 scan1)
   deleted: (memempty r2) (located scan1 wp4)
   added: (helddata r2 scan1)
   goals met: 3 of 6
15. (transmit_data r2 l2 scan1)
   deleted: (helddata r2 scan1)
   added: (memempty r2) (helddata l2 scan1) (transmitted scan1)
   goals met: 4 of 6
16. (deposit_sample r1 l1 wp2 smpl2)
   deleted: (heldsample r1 smpl2) (storeempty l1)
   added: (storeempty r1) (heldsample l1 smpl2) (sampledeposited smpl2)
   goals met: 5 of 6
17. (move_rover r1 wp2 wp3)
   deleted: (located r1 wp2)
   added: (located r1 wp3)
   goals met: 5 of 6
18. (capture_image r1 wp3 img1)
   deleted: (memempty r1) (located img1 wp3)
   added: (helddata r1 img1)
   goals met: 5 of 6
19. (transmit_data r1 l1 img1)
   deleted: (helddata r1 img1)
   added: (memempty r1) (helddata l1 img1) (transmitted img1)
   goals met: 6 of 6
